In [18]:
import os
from datetime import datetime, timedelta
from scipy import stats
import pandas as pd

In [2]:
def read_database(file_name):
    return pd.read_csv(file_name)

In [8]:
df_sales = read_database('2022-04-01T12_df_sales.csv')
df_sales['date'] = pd.to_datetime(df_sales['date'])
df_users = read_database('experiment_users.csv')

In [9]:
df_sales.head(3)

   sale_id                date  count_pizza  count_drink  price user_id
0  1000001 2022-02-04 10:00:24            1            0    720  1c1543
1  1000002 2022-02-04 10:02:28            1            1    930  a9a6e8
2  1000003 2022-02-04 10:02:35            3            1   1980  23420a

In [11]:
df_users.head(3)

  user_id  pilot
0  0ffc65      0
1  b962b9      0
2  7ea63f      0

In [12]:
# считаем значения метрики
begin_date = datetime(2022, 3, 16)
end_date = datetime(2022, 3, 23)
df_metrics = (
    df_sales
    [(df_sales['date'] >= begin_date) & (df_sales['date'] < end_date)]
    .groupby('user_id')[['price']].sum()
    .reset_index()  
)

In [13]:
df_metrics.head()

  user_id  price
0  000096    720
1  00092c    780
2  000bb2    720
3  000ea9   1560
4  000ec6    690

In [16]:
df = pd.merge(df_users, df_metrics, on='user_id', how='left').fillna(0)
df.head(2)

  user_id  pilot  price
0  0ffc65      0    0.0
1  b962b9      0    0.0

In [27]:
data_control = df[df['pilot'] == 0]['price']
data_pilot = df[df['pilot'] == 1]['price']
t_statistic, p_value = stats.ttest_ind(data_control, data_pilot)
print(f"P-value: {p_value:0.3f}")

P-value: 0.199